{ "class_name": "Sequential", "config": { "name": "sequential", "layers": [{ "class_name": "InputLayer", "config": { "batch_input_shape": [null, 48, 48, 1], "dtype": "float32", "sparse": false, "name": "input_layer" } }, { "class_name": "Conv2D", "config": { "name": "conv2d", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} } } }, { "class_name": "Conv2D", "config": { "name": "conv2d_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} } } }, { "class_name": "MaxPooling2D", "config": { "name": "max_pooling2d", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last" } }, { "class_name": "Dropout", "config": { "name": "dropout", "trainable": true, "rate": 0.25 } }, { "class_name": "Conv2D", "config": { "name": "conv2d_2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} } } }, { "class_name": "MaxPooling2D", "config": { "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last" } }, { "class_name": "Conv2D", "config": { "name": "conv2d_3", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} } } }, { "class_name": "MaxPooling2D", "config": { "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last" } }, { "class_name": "Dropout", "config": { "name": "dropout_1", "trainable": true, "rate": 0.25 } }, { "class_name": "Flatten", "config": { "name": "flatten", "trainable": true } }, { "class_name": "Dense", "config": { "name": "dense", "trainable": true, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} } } }, { "class_name": "Dropout", "config": { "name": "dropout_2", "trainable": true, "rate": 0.5 } }, { "class_name": "Dense", "config": { "name": "dense_1", "trainable": true, "units": 7, "activation": "softmax", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} } } }] } }